-- QuestData.lua
-- @Author : Dencer (tdaddon@163.com)
-- @Link   : https://dengsir.github.io
-- @Date   : 4/21/2021, 10:56:19 AM
--
BuildEnv(...)

if not ADDON_REGIONSUPPORT then
    return
end

QUEST_CFG_DATA = { --
    [1] = {
        title = [[{{GetNoReset}}{{GetTimeLimitText}}通关{{progressMaxValue}}次{{challengeLevel}}层及以上史诗钥石地下城]],
        proto = {'challengeLevel', 'timeLimit', 'noReset'},
    },
    [2] = {title = [[]], proto = {}},
    [3] = {title = [[{{titleL}}]], proto = {'titleL', 'extern', 'url'}},
}

QUEST_GROUP_DATA = {
    [4] = {
        score = '我本周的积分：',
        title = '史诗钥石挑战',
        subTitle = '集合石史诗钥石地下城冲分挑战',
        extern = '查看排名',
        url = [[https://wow.blizzard.cn/rank]],
        summary = [[1.玩家可以自由组队完成“史诗钥石地下城挑战”；
2.玩家使用游戏内符合等级要求的钥石进行游戏即可参与挑战；
3.玩家可在符合等级条件的任意地下城中完成任务；
4.周常进度和奖励领取在每周副本CD更新时重置，请及时领取奖励，未领取视作放弃。为避免进度更新失败，请尽量避免临近CD更新时（每周四凌晨3点）完成任务；
5.本次活动所有奖励在插件上领取，完成任务后可插件内领取奖励，若您在完成任务后超过72小时仍无法领取奖励，请联系人工客服进行反馈；
6.没有安装插件的玩家将无法兑换相应的奖励；
7.活动到期后，通关记录将不再被计入本次活动，也无法再获取相关奖励；
8.同一种虚拟物品奖励，每个角色至多可以领取4次，不同挑战活动的不同虚拟物品奖励，每个角色达到任务目标后都可以领取，不同角色可以重复参与活动并且在达到挑战目标后领取相应的虚拟物品奖励；
9.若在72小时内奖励未发送至游戏角色邮箱，请联系人工客服进行反馈；
10.本次挑战活动由于数量较大，当您完成通关后，请点击左上角的【刷新】按钮查看最新进度，刷新后每30分钟更新一次数据结果；
11.请注意，角色进行改名、转服等操作会导致无法正常发放奖励，为了保证您能够正常获取奖励，请勿在活动期间使用改名、转服等服务。]],
        localQuest = {
            {
                100001, 3, nil, {{199202, 4}},
                [[通关15层（含）及以上史诗钥石地下城，并在当周排行榜中达到前30000排名（含）自动获取]],
                '查看周排行榜', 'https://wow.blizzard.cn/rank',
            }, {
                100002, 3, nil, {{36941, 1}},
                [[通关15层（含）及以上史诗钥石地下城获得评分，并在活动结束时在总排行榜中排名前5000（含）自动获取]],
                '查看总排行榜', 'https://wow.blizzard.cn/rank',
            }, {
                100003, 3, nil, {{37297, 1}},
                [[通关15层（含）及以上史诗钥石地下城获得评分，并在活动结束时在总排行榜中排名前250（含）自动获取]],
                '查看总排行榜', 'https://wow.blizzard.cn/rank',
            },
        },
    },
}
