LegionRaresTreasures = LibStub("AceAddon-3.0"):NewAddon("LegionRaresTreasures", "AceBucket-3.0", "AceConsole-3.0", "AceEvent-3.0", "AceTimer-3.0")
local HandyNotes = LibStub("AceAddon-3.0"):GetAddon("HandyNotes", true)

if not HandyNotes then return end

local iconDefaults = {
    skull_grey = "Interface\\Addons\\HandyNotes_LegionRaresTreasures\\Artwork\\RareIcon.blp",
    skull_blue = "Interface\\Addons\\HandyNotes_LegionRaresTreasures\\Artwork\\RareIconBlue.blp",
	default = "Interface\\Icons\\TRADE_ARCHAEOLOGY_CHESTOFTINYGLASSANIMALS",
--[[swprare = "Interface\\Icons\\Trade_Archaeology_Fossil_SnailShell",
    shrine = "Interface\\Icons\\inv_misc_statue_02",
    glider = "Interface\\Icons\\inv_feather_04",
    rocket = "Interface\\Icons\\ability_mount_rocketmount",
    unknown = "Interface\\Addons\\HandyNotes_LegionRaresTreasures\\Artwork\\chest_normal_daily.tga",
    skull_green = "Interface\\Addons\\HandyNotes_LegionRaresTreasures\\Artwork\\RareIconGreen.tga", 
    skull_orange = "Interface\\Addons\\HandyNotes_LegionRaresTreasures\\Artwork\\RareIconOrange.tga",
    skull_purple = "Interface\\Addons\\HandyNotes_LegionRaresTreasures\\Artwork\\RareIconPurple.tga",
    skull_red = "Interface\\Addons\\HandyNotes_LegionRaresTreasures\\Artwork\\RareIconRed.tga",
    skull_yellow = "Interface\\Addons\\HandyNotes_LegionRaresTreasures\\Artwork\\RareIconYellow.tga",]]
}
local PlayerFaction, _ = UnitFactionGroup("player")
LegionRaresTreasures.nodes = { }

local nodes = LegionRaresTreasures.nodes
local isTomTomloaded = false
local isDBMloaded = false

nodes["Azsuna"] = {
	[58381229]={ "37980", "宝箱", "神器能量", "需要在 58.7 / 14.1 使用传送门", "default", "treasure_azs","131751"},
    [57901220]={ "37958", "宝箱", "神器能量", "", "default", "treasure_azs","138783"},
	[51502435]={ "42289", "宝箱", "神器能量", "在洞穴内，入口在 47.8 / 23.7", "default", "treasure_azs","138783"},
	[56443481]={ "38251", "宝箱", "神器能量", "", "default", "treasure_azs","132950"},
	[58364378]={ "37830", "闪光宝箱", "神器能量", "", "default", "treasure_azs","138783"},
	[53543982]={ "42284", "小宝箱", "神器能量", "神殿内有两个财宝", "default", "treasure_azs","131795"},
	[53543982]={ "42285", "小宝箱", "神器能量", "神殿内有两个财宝", "default", "treasure_azs","131795"},
    [42600810]={ "38367", "宝箱", "神器能量", "", "default", "treasure_azs","138783"},
	[55905690]={ "38365", "争议宝箱", "神器能量", "", "default", "treasure_azs","138783"},
	[62405840]={ "42273", "小宝箱", "神器能量", "", "default", "treasure_azs","138783"},
	[63005420]={ "42278", "小宝箱", "神器能量", "洞穴内入口在 64.0 / 52.9", "default", "treasure_azs","138783"},
	[65462961]={ "42958", "小宝箱", "神器能量", "", "default", "treasure_azs","138783"},
	[53504545]={ "42283", "小宝箱", "神器能量", "", "default", "treasure_azs","138783"},
	[47860773]={ "42295", "小宝箱", "神器能量", "", "default", "treasure_azs", "138783"},
	[55621855]={ "40711", "宝箱", "神器能量", "", "default", "treasure_azs", "138783"},
	[53611813]={ "44104", "小宝箱", "神器能量", "", "default", "treasure_azs", "138783"},
	[63231521]={ "37832", "宝箱", "神器能量", "", "default", "treasure_azs", "138783"},
	[68872973]={ "44103", "小宝箱", "神器能量", "在水下洞穴内，入口在东侧悬崖上", "default", "treasure_azs", "138783"},
	[56892499]={ "42338", "小宝箱", "神器能量", "洞穴内入口在 55.7 / 25.4", "default", "treasure_azs", "138783"},
	[55362774]={ "42288", "小宝箱", "神器能量", "", "default", "treasure_azs", "138783"},
	[57153106]={ "38419", "宝箱", "神器能量", "", "default", "treasure_azs", "138783"},
	[54313633]={ "42287", "小宝箱", "神器能量", "", "default", "treasure_azs", "138783"},
	[53033726]={ "37596", "小宝箱", "神器能量", "", "default", "treasure_azs", "138783"},
	[66064345]={ "40751", "小宝箱", "神器能量", "", "default", "treasure_azs", "138783"},
	[62814479]={ "42294", "小宝箱", "神器能量", "", "default", "treasure_azs", "138783"},
	[50465211]={ "44081", "不听话的牡马", "神器能量", "需要在  60.35 到 46.31 使用传送门到达那里。杀死两个牡马之后会刷新小宝箱", "default", "treasure_azs", "140685"},
	[58645340]={ "40752", "小宝箱", "神器能量", "", "default", "treasure_azs", "138783"},
	[59876316]={ "42272", "小宝箱", "神器能量", "", "default", "treasure_azs", "138783"},
	[65066978]={ "38239", "看似无人看守的宝藏", "全能戒指", "点击之后出现5个敌人。击败他们之后再次拾取财宝", "default", "treasure_azs", "129070"},
	[53176444]={ "37829", "宝箱", "神器能量", "", "default", "treasure_azs", "138783"},
	[49415800]={ "38370", "宝箱", "神器能量", "", "default", "treasure_azs", "138783"},
	[54875214]={ "44405", "小宝箱", "神器能量", "区域内所有怪物会进入战斗", "default", "treasure_azs", "138783"},
	[49384536]={ "37828", "宝箱", "神器能量+玩具", "", "default", "treasure_azs", "122681"},
	[50215029]={ "42290", "小宝箱", "神器能量", "", "default", "treasure_azs", "138783"},
	[52004210]={ "42281", "小宝箱", "神器能量", "", "default", "treasure_azs", "138783"},
	[53684396]={ "42282", "小宝箱", "神器能量", "", "default", "treasure_azs", "138783"},
	[63653919]={ "42293", "小宝箱", "神器能量", "", "default", "treasure_azs", "138783"},
	[49653448]={ "37831", "小宝箱", "神器能量", "", "default", "treasure_azs", "138783"},
	[44473946]={ "37713", "小宝箱", "神器能量", "", "default", "treasure_azs", "138783"},
	[40575767]={ "38316", "宝箱", "神器能量", "", "default", "treasure_azs", "138783"},
	[26254713]={ "44105", "小宝箱", "神器能量", "", "default", "treasure_azs", "138783"},
	[41393075]={ "42292", "宝箱", "神器能量", "", "default", "treasure_azs", "138783"},
	[34583556]={ "44102", "小宝箱", "神器能量", "", "default", "treasure_azs", "138783"},
	[43392242]={ "42297", "闪闪发光的宝箱", "神器能量", "上山路径起点在 39.14 / 32.84", "default", "treasure_azs", "138783"},
	[52842059]={ "42339", "宝箱", "神器能量", "洞穴入口在 53.95 / 22.43 | The bears will keep sleeping unless you disturb them", "default", "treasure_azs", "138783"},

	[52382304]={ "38268", "Cailyn Paledoom", "急速/精通皮甲头盔", "", "skull_grey", "rare_azs", "129063"},
	[43172813]={ "38352", "马瑞斯与特德对末日领主", "智力/暴击饰品", "", "skull_grey", "rare_azs", "129056"},
	[34963391]={ "42505", "奥术师沙尔曼", "暴击/急速布甲护腕", "池子周围", "skull_grey", "rare_azs", "141868"},
	[30774799]={ "42286", "Houndmaster Stroxis", "暴击/急速锁甲腰带", "", "skull_grey", "rare_azs", "141873"},
	[29275366]={ "42417", "拜尔班", "暴击/急速皮甲脚部", "", "skull_grey", "rare_azs", "129079"},
	[37374318]={ "42280", "沃萨克斯", "暴击/精通锁甲胸部", "", "skull_grey", "rare_azs", "141875"},
	[32292972]={ "38238", "滩沙", "急速/全能板甲肩部", "在海滩巡逻", "skull_grey", "rare_azs", "129067"},
	[49105519]={ "37909", "找到并消灭小队", "暴击/急速锁甲护腕", "与邪能猎手在路上巡逻", "skull_grey", "rare_azs", "129069"},
	[49500880]={ "37928", "被驱逐的诺曼提斯", "暴击/急速布甲头盔", "", "skull_grey", "rare_azs", "129061"},
	[56102906]={ "38061", "猫王米奥", "暴击/精通皮甲头盔", "", "skull_grey", "rare_azs", "138395"},
	[35305030]={ "38037", "地狱火领主", "暴击/精通板甲头盔", "地狱火宝箱", "skull_grey", "rare_azs","129083"},
	[32604880]={ "44108", "怒喉", "急速/精通披风", "", "skull_grey", "rare_azs","129075"},
	[47303460]={ "37726", "风暴使者瓦里亚卡", "急速/精通布甲手套", "", "skull_grey", "rare_azs","129082"},
	[50803160]={ "37869", "刀喙", "急速/精通皮甲腿部", "", "skull_grey", "rare_azs","129084"},
	[59601230]={ "37932", "狂暴的裂隙", "暴击/急速布甲肩部", "击败多波怪物之后激活狂暴的裂隙", "skull_grey", "rare_azs","129085"},
	[45305780]={ "37824", "船长克星弗洛格", "暴击/急速披风", "", "skull_grey", "rare_azs","129090"},
	[65545679]={ "42221", "苦水酋长", "暴击/急速戒指", "", "skull_grey", "rare_azs","129073"},
	[61306200]={ "38217", "潮汐巨兽", "急速/全能锁甲头盔", "", "skull_grey", "rare_azs","129062"},
	[59705520]={ "37822", "神谕者", "暴击/精通布甲腿部", "", "skull_grey", "rare_azs","129065"},
	[41054178]={ "37537", "拉文达斯", "急速/精通皮甲手套", "", "skull_grey", "rare_azs","129080"},
	[67105140]={ "37989", "赛法努斯和利奥达斯", "暴击/急速板甲腿部", "!!! 等级110 !!!", "skull_blue", "rare_azs","129064"},
    [50003440]={ "37823", "织潮者墨古尔", "暴击/急速项链", "", "skull_grey", "rare_azs","129072"},
	[53404400]={ "37821", "沃洛伦船长", "急速/精通皮甲肩部", "", "skull_grey", "rare_azs","129066"},
	[55104590]={ "42450", "布拉戈斯", "急速/精通板甲腰带", "", "skull_grey", "rare_azs","129086"},
	[65164000]={ "37820", "海妖号角", "敏捷/精通饰品", "", "skull_grey", "rare_azs","129091"},	
	[59304630]={ "38212", "马瑞斯与特德对邪能领主", "急速/精通锁甲肩部", "在上顶上", "skull_grey", "rare_azs", "129068"},
	[33404120]={ "44670", "蛛母丽萨克丝", "急速/精通皮甲胸部", "", "skull_grey", "rare_azs", "141869"},
	[43572444]={ "42069", "恐翼", "暴击/精通皮甲护腕", "上山路径起点在 39.14 / 32.84", "skull_grey", "rare_azs", "129087"},
}

nodes["Valsharah"] = {
	[65867918]={ "38391", "小宝箱", "神器能量", "", "default", "treasure_val","138783"},
	[56008376]={ "38861", "小宝箱", "神器能量", "", "default", "treasure_val","138783"},
	[56225730]={ "39072", "小宝箱", "神器能量", "", "default", "treasure_val","138783"},
	[62707040]={ "39069", "小宝箱", "神器能量", "在二楼阳台", "default", "treasure_val","138783"},
	[63007700]={ "39070", "小宝箱", "神器能量", "", "default", "treasure_val","138783"},
	[61657372]={ "39087", "小宝箱", "神器能量", "", "default", "treasure_val","138783"},
	[38456530]={ "39080", "小宝箱", "神器能量", "在地窖内。需要任务 -农场", "default", "treasure_val","138783"},
	[45106114]={ "39083", "小宝箱", "神器能量", "在树上", "default", "treasure_val","138783"},
	[63904556]={ "44139", "小宝箱", "神器能量", "", "default", "treasure_val","138783"},
	[54506048]={ "39097", "宝箱", "神器能量", "在洞穴内", "default", "treasure_val","130152"},
	[54187061]={ "39093", "小宝箱", "神器能量", "在洞穴内", "default", "treasure_val","138783"},
	[54417419]={ "38359", "小宝箱", "神器能量", "房子内木质窗帘后面", "default", "treasure_val","138783"},
	[51247777]={ "38388", "小宝箱", "神器能量", "洞穴入口在 50.9 / 77", "default", "treasure_val","138783"},
	[54958054]={ "38861", "小宝箱", "神器能量", "在水下洞穴内", "default", "treasure_val","138783"},
	[48998615]={ "38886", "小宝箱", "神器能量", "", "default", "treasure_val","138783"},
	[46448630]={ "38277", "小宝箱", "神器能量", "", "default", "treasure_val","138783"},
	[44358257]={ "38387", "宝箱", "神器能量", "在旅店下面的洞穴内，入口就在建筑物第一层下面", "default", "treasure_val","141892"},
	[43068822]={ "44138", "宝箱", "神器能量", "洞穴入口在 43.7 / 89.9", "default", "treasure_val","138783"},
	[48687379]={ "38366", "小宝箱", "神器能量", "", "default", "treasure_val","138783"},
	[43397589]={ "38363", "小宝箱", "神器能量", "", "default", "treasure_val","138783"},
	[33815826]={ "39081", "宝箱", "神器能量", "", "default", "treasure_val","138783"},
	[42665801]={ "39077", "小宝箱", "神器能量", "", "default", "treasure_val","138783"},
	[38626718]={ "39079", "小宝箱", "神器能量", "", "default", "treasure_val","138783"},
	[43225488]={ "39084", "宝箱", "神器能量", "在墙面上部", "default", "treasure_val","138783"},
	[39945460]={ "38369", "小宝箱", "神器能量", "", "default", "treasure_val","138783"},
	[41404560]={ "39085", "小宝箱", "神器能量", "入口在墙面上部 41.4 / 45.6", "default", "treasure_val","138783"},
	[41404560]={ "39086", "闪闪发光的宝箱", "神器能量", "入口在墙面上部 41.4 / 45.6", "default", "treasure_val","138783"},
	[55557762]={ "38466", "无人看守的蓟叶宝藏", "宠物", "并不是没有守卫", "default", "treasure_val","130147"},
	[61073421]={ "39088", "宝箱", "神器能量", "水下树根内", "default", "treasure_val","138783"},
	[68334060]={ "39073", "小宝箱", "神器能量", "", "default", "treasure_val","138783"},
	[66284122]={ "39108", "宝箱", "神器能量", "", "default", "treasure_val","138783"},
	[67215928]={ "38782", "宝箱", "神器能量", "洞穴入口在 65.9 / 56.3", "default", "treasure_val","138783"},
	[70225704]={ "38783", "小宝箱", "神器能量", "", "default", "treasure_val","138783"},
	[69475999]={ "38781", "小宝箱", "神器能量", "", "default", "treasure_val","138783"},
	[67395342]={ "38386", "小宝箱", "神器能量", "", "default", "treasure_val","138783"},
	[64715126]={ "38355", "小宝箱", "神器能量", "", "default", "treasure_val","138783"},
	[54003489]={ "38390", "闪闪发光的宝箱", "神器能量", "洞穴入口在 53.2 / 38.0", "default", "treasure_val","141891"},
	[62076737]={ "39071", "宝箱", "神器能量", "", "default", "treasure_val","138783"},
	[63277401]={ "39102", "宝箱", "神器能量", "", "default", "treasure_val","138783"},
	[61017917]={ "39089", "闪闪发光的宝箱", "神器能量", "", "default", "treasure_val","138783"},
	[62708526]={ "44136", "小宝箱", "神器能量", "", "default", "treasure_val","138783"},
	[64608546]={ "38900", "宝箱", "神器能量", "", "default", "treasure_val","138783"},
	[60498216]={ "38893", "小宝箱", "神器能量", "洞穴入口在 62.1 / 86.16", "default", "treasure_val","138783"},
	[65398629]={ "39074", "宝箱", "神器能量", "", "default", "treasure_val","138783"},
	[59887228]={ "38943", "小宝箱", "神器能量", "楼上，楼梯间", "default", "treasure_val", "138783"},
	[73835437]={ "44135", "小宝箱", "神器能量", "", "default", "treasure_val", "138783"},
	[73803227]={ "38371", "小宝箱", "神器能量", "", "default", "treasure_val", "138783"},
	[63378841]={ "38389", "小宝箱", "神器能量", "", "default", "treasure_val","138783"},
	
	[60359065]={ "38887", "艾琳迪亚·羽光", "急速/精通布甲脚部", "解救她并跟随她击杀斯库瓦克斯", "skull_grey", "rare_val","130115"},
	[59747747]={ "38468", "血喙", "宠物", "与 Lorel Sagefeather 交谈召唤他", "skull_grey", "rare_val","130154"},
	[52788750]={ "38889", "发抖的灰喉熊崽", "宠物", "", "skull_grey", "rare_val","128690"},
	[65805344]={ "40126", "女巫格蕾尔达", "暴击/急速项链", "", "skull_grey", "rare_val","130122"},
	[62604750]={ "38780", "松达克斯", "暴击/精通锁甲护腕", "", "skull_grey", "rare_val","130121"},
	[60314427]={ "39858", "德拉博格", "暴击/急速披风", "", "skull_grey", "rare_val","130125"},
	[44145209]={ "38767", "黑暗之影，刃豹主母 ", "宠物", "最下层，仔细寻找一下", "skull_grey", "rare_val","130166"},
	[61056940]={ "39596", "腐蚀者皮里克斯", "暴击/精通锁甲肩部", "", "skull_grey", "rare_val","130137"},
	[45598879]={ "43446", "巴哈加", "全能/精通皮甲腿部", "", "skull_grey", "rare_val","130135"},
	[47225802]={ "39357", "亨利", "玩具", "", "skull_grey", "rare_val","130214"},
	[34425828]={ "39121", "闹鬼庄园", "神器能量", "", "skull_grey", "rare_val","141876"},
	[58773402]={ "40080", "铁枝", "职业大厅资源", "", "skull_grey", "rare_val","1220"},
	[61792954]={ "40079", "利拉斯·月羽", "暴击/急速布甲手套", "", "skull_grey", "rare_val","130118"},
	[66873686]={ "39856", "怒爪", "急速/精通皮甲手套", "", "skull_grey", "rare_val","130116"}, --second QuestID 43447
	[67166962]={ "43176", "安德盖尔攻击", "急速/精通板甲头盔", "", "skull_grey", "rare_val","130133"},
	[38065281]={ "38772", "泰莉西亚 ", "全能/精通布甲胸部", "", "skull_grey", "rare_val", "130136"},
	[41647827]={ "38479", "希尔赛", "玩具", "", "skull_grey", "rare_val", "130171"},
	[67504510]={ "39130", "恶臭的波洛斯", "宠物", "", "skull_grey", "rare_val", "130168"},
}

nodes["Highmountain"] = {
	[54174159]={ "40483", "闪闪发光的宝箱", "神器能量", "洞穴入口在 55.1 / 44.3", "default", "treasure_hmn","138783"},
	[52023241]={ "40505", "宝箱", "神器能量", "", "default", "treasure_hmn","138783"},
	[39704830]={ "39494", "漂浮的宝箱", "神器能量", "浮在河面上", "default", "treasure_hmn","131763"},
	[55134965]={ "40487", "小宝箱", "神器能量", "", "default", "treasure_hmn","138783"},
	[43582510]={ "40478", "宝箱", "神器能量", "洞穴入口在 42.5 / 25.4", "default", "treasure_hmn","138783"},
	[49647128]={ "39606", "小宝箱", "神器能量", "", "default", "treasure_hmn","138783"},
	[39376229]={ "40474", "宝箱", "神器能量", "", "default", "treasure_hmn", "138783"},
	[53035224]={ "40493", "小宝箱", "神器能量", "", "default", "treasure_hmn", "138783"},
	[53454352]={ "40484", "小宝箱", "神器能量", "", "default", "treasure_hmn", "138783"},
	[53063946]={ "40499", "小宝箱", "神器能量", "", "default", "treasure_hmn", "138783"},
	[50983880]={ "40498", "宝箱", "神器能量", "", "default", "treasure_hmn", "138783"},
	[50013714]={ "39466", "宝箱", "破碎群岛缓落玩具组件的四部分之一", "", "default", "treasure_hmn", "131927"},
	[42203482]={ "40480", "小宝箱", "神器能量", "", "default", "treasure_hmn", "138783"},
	[37353381]={ "40477", "小宝箱", "神器能量", "", "default", "treasure_hmn", "138783"},
	[45573462]={ "40481", "小宝箱", "神器能量", "", "default", "treasure_hmn", "138783"},
	[55134964]={ "40487", "小宝箱", "神器能量", "", "default", "treasure_hmn", "138783"},
	[39307621]={ "40473", "宝箱", "神器能量", "似乎有轻微的位置问题，可以从后面图腾拿到财宝", "default", "treasure_hmn", "138783"},  
	[46227340]={ "40489", "宝箱", "神器能量", "洞穴", "default", "treasure_hmn", "138783"},  
	[43757275]={ "40510", "小宝箱", "神器能量", "", "default", "treasure_hmn", "138783"},  
	[36616213]={ "40488", "宝箱", "神器能量", "", "default", "treasure_hmn", "138783"}, 
	[53414868]={ "40500", "小宝箱", "神器能量", "", "default", "treasure_hmn", "138783"},  
	[52305141]={ "39766", "完全安全的宝箱", "神器能量", "点击宝箱会召唤守财巨虫", "default", "treasure_hmn", "131802"},  
	[42212730]={ "40479", "宝箱", "神器能量", "", "default", "treasure_hmn", "138783"},  
	[45192746]={ "44279", "小宝箱", "神器能量", "在水下洞穴内", "default", "treasure_hmn", "138783"},  
	[46682810]={ "40482", "闪闪发光的宝箱", "神器能量", "在建筑物顶部", "default", "treasure_hmn", "138783"},    
	[50983647]={ "40496", "宝箱", "神器能量", "", "default", "treasure_hmn", "138783"},  
	[50243861]={ "40497", "小宝箱", "神器能量", "", "default", "treasure_hmn", "138783"},  
	[50813504]={ "40506", "小宝箱", "神器能量", "", "default", "treasure_hmn", "138783"},  
	[46814013]={ "40507", "小宝箱", "神器能量", "", "default", "treasure_hmn", "138783"},  
	[47644406]={ "39503", "宝箱", "破碎群岛缓落玩具组件的四部分之一", "", "default", "treasure_hmn", "131926"},  
	[53615103]={ "39824", "宝箱", "破碎群岛缓落玩具组件的四部分之一", "在拳击稀有上面的树枝上", "default", "treasure_hmn", "131810"},  
	
	[54394112]={ "40414", "噬人黑暗", "急速/精通布甲脚部", "洞穴入口在 55.1 / 44.3 | 吹灭蜡烛召唤他", "skull_grey", "rare_hmn","131780"},
	[53755123]={ "39872", "野蛮的拳手", "暴击/急速板甲腰带", "宝物在他的箱子内", "skull_grey", "rare_hmn","131800"},
	[41513184]={ "40175", "沉睡的熊", "暴击/急速项链", "", "skull_grey", "rare_hmn","131921"},
	[46643144]={ "39646", "威严的大角鹿", "至高岭坐骑增益", "", "skull_grey", "rare_hmn","131900"},
	[49202709]={ "40242", "麦罗克，图鲁克之子", "神器能量", "", "skull_grey", "rare_hmn","131808"},	
	[40975775]={ "39963", "炎鳞", "急速/精通锁甲胸部", "点击被遗弃的鱼竿", "skull_grey", "rare_hmn","131773"},
	[45705500]={ "40681", "瑟坎", "急速/精通皮甲腰带", "", "skull_grey", "rare_hmn","131730"},
	[51074825]={ "39802", "强夺者哈特里", "神器能量", "", "skull_grey", "rare_hmn","138783"},
	[43164800]={ "40413", "业余猎手", "暴击/精通板甲脚部", "宝物在箱子内", "skull_grey", "rare_hmn","131781"},
	[54447454]={ "40773", "霜裂", "职业大厅资源", "!!! 等级110 !!!", "skull_blue", "rare_hmn","1220"},
	[51463189]={ "39465", "天须工头", "暴击/全能布甲护腕", "", "skull_grey", "rare_hmn","131769"},
	[41944149]={ "39782", "坦帕克·烈焰图腾", "宠物", "", "skull_grey", "rare_hmn","129175"},
	[48605000]={ "39784", "兽王包勒克", "暴击/急速锁甲手套", "", "skull_grey", "rare_hmn","131756"},
	[37704570]={ "40405", "蓟槌", "急速/精通皮甲头盔", "", "skull_grey", "rare_hmn","131761"},
	[44201210]={ "39994", "海蟹骑手格姆尔", "急速/精通皮甲胸部", "在区域内巡逻", "skull_grey", "rare_hmn","131798"},
	[46500744]={ "40096", "被俘的幸存者", "暴击戒指", "", "skull_grey", "rare_hmn","131797"},
	[56406050]={ "40347", "突袭者戈尔伯格", "暴击/急速板甲胸部", "在区域内巡逻", "skull_grey", "rare_hmn","131775"},
	[56357250]={ "39235", "强大的波古尔", "急速/精通锁甲脚部", "", "skull_grey", "rare_hmn", "138396"},
	[36741635]={ "40084", "囤积者博达什", "力量饰品精通专属", "", "skull_grey", "rare_hmn", "131799"},
	[48502546]={ "39646", "威严的大角鹿", "坐骑增益+玩具", "在全部区域内巡逻", "skull_grey", "rare_hmn", "131900"},
	[51062570]={ "39762", "莎拉·魔息", "急速/精通布甲胸部", "", "skull_grey", "rare_hmn", "131791"},
	[48414015]={ "39806", "饥饿的克劳舒克", "破碎群岛缓落玩具组件的四部分之一", "", "skull_grey", "rare_hmn", "131809"},
	[54504060]={ "39866", "米塔·啸爪", "暴击/急速披风", "在山顶上 - 与 NPC 交谈", "skull_grey", "rare_hmn", "131792"},
	[50803460]={ "40406", "食蛋者卢古特", "暴击/精通锁甲腰带", "在洞穴内", "skull_grey", "rare_hmn", "131776"},
 }
 
nodes["Stormheim"] = {
	[35725407]={ "38677", "宝箱", "神器能量", "", "default", "treasure_sth","138783"},
	[31105600]={ "38676", "小宝箱", "职业大厅资源", "", "default", "treasure_sth","1220"},
	[27335749]={ "38529", "宝箱", "神器能量", "洞穴入口在 31.4 / 57.1", "default", "treasure_sth","138783"},
	[32054719]={ "43196", "宝箱", "神器能量", "", "default", "treasure_sth","138783"},
	[41744604]={ "38488", "小宝箱", "神器能量", "", "default", "treasure_sth","138783"},
	[50314100]={ "38483", "小宝箱", "神器能量", "", "default", "treasure_sth","138783"},
	[48137421]={ "38476", "小宝箱", "神器能量", "", "default", "treasure_sth","138783"},
	[42616579]={ "38474", "宝箱", "神器能量", "", "default", "treasure_sth","138783"},
	[46768040]={ "38481", "宝箱", "神器能量", "需要雷铸爪钩枪", "default", "treasure_sth","138783"},
	[61404440]={ "40093", "小宝箱", "神器能量", "", "default", "treasure_sth","138783"},
	[60834273]={ "40094", "小宝箱", "神器能量", "需要雷铸爪钩枪", "default", "treasure_sth","138783"},
	[55004716]={ "40095", "宝箱", "神器能量", "", "default", "treasure_sth","138783"},
	[67935774]={ "40083", "小宝箱", "神器能量", "", "default", "treasure_sth","138783"},
	[69144478]={ "38637", "小宝箱", "神器能量", "", "default", "treasure_sth","138783"},
	[73334150]={ "40085", "小宝箱", "神器能量", "", "default", "treasure_sth","138783"},
	[61836289]={ "40089", "宝箱", "神器能量", "", "default", "treasure_sth","138783"},
	[57946321]={ "40090", "小宝箱", "神器能量", "", "default", "treasure_sth","138783"},
	[49777801]={ "38485", "小宝箱", "神器能量", "需要雷铸爪钩枪", "default", "treasure_sth", "138783"},
	[65364310]={ "43205", "小宝箱", "神器能量", "", "default", "treasure_sth", "138783"},
	[52018058]={ "38480", "小宝箱", "神器能量", "需要雷铸爪钩枪", "default", "treasure_sth", "138783"},
	[72135489]={ "42628", "小宝箱", "神器能量", "", "default", "treasure_sth", "138783"},
	[65585737]={ "43187", "小宝箱", "神器能量", "", "default", "treasure_sth", "138783"},
	[62667362]={ "40091", "小宝箱", "神器能量", "", "default", "treasure_sth", "138783"},
	[39571934]={ "38498", "小宝箱", "神器能量", "", "default", "treasure_sth", "138783"},
	[35924792]={ "38680", "小宝箱", "神器能量", "", "default", "treasure_sth", "138783"},
	[33143607]={ "38495", "宝箱", "神器能量", "", "default", "treasure_sth", "138783"},
	[35033660]={ "38487", "宝箱", "神器能量", "洞穴入口在34.8 / 34.23", "default", "treasure_sth", "138783"},
	[32742791]={ "38490", "宝箱", "神器能量", "洞穴入口在33.65 / 27.35", "default", "treasure_sth", "138783"},
	[43164049]={ "43238", "小宝箱", "神器能量", "", "default", "treasure_sth", "138783"},
	[44983823]={ "43240", "小宝箱", "神器能量", "", "default", "treasure_sth", "138783"},
	[47463412]={ "43255", "小宝箱", "神器能量", "", "default", "treasure_sth", "138783"},
	[42473407]={ "43189", "宝箱", "神器能量", "雕像入口在 42.24 / 34.87", "default", "treasure_sth", "141896"},
	[37183865]={ "43208", "小宝箱", "神器能量", "", "default", "treasure_sth", "138783"},
	[61933255]={ "38744", "小宝箱", "神器能量", "", "default", "treasure_sth", "138783"},
	[68462959]={ "40108", "宝箱", "神器能量", "", "default", "treasure_sth", "138783"},
	[58044751]={ "40082", "小宝箱", "神器能量", "", "default", "treasure_sth", "138783"},
	[64293956]={ "43302", "小宝箱", "神器能量", "", "default", "treasure_sth", "138783"},
	[68974183]={ "40086", "小宝箱", "神器能量", "", "default", "treasure_sth", "138783"},
	[74414182]={ "43306", "小宝箱", "神器能量", "", "default", "treasure_sth", "138783"},
	[71924425]={ "43305", "小宝箱", "神器能量", "", "default", "treasure_sth", "138783"},
	[73154570]={ "43194", "小宝箱", "神器能量", "", "default", "treasure_sth", "138783"},
	[73965223]={ "42632", "小宝箱", "神器能量", "", "default", "treasure_sth", "138783"},
	[75164949]={ "42629", "宝箱", "神器能量", "在帆船顶部", "default", "treasure_sth", "138783"},
	[73975858]={ "43237", "小宝箱", "神器能量", "", "default", "treasure_sth", "138783"},
	[75676060]={ "43304", "小宝箱", "神器能量", "", "default", "treasure_sth", "138783"},
	[82405451]={ "43191", "小宝箱", "神器能量", "", "default", "treasure_sth", "138783"},
	[81876750]={ "40099", "宝箱", "神器能量", "", "default", "treasure_sth", "138783"},
	[69986719]={ "43188", "小宝箱", "神器能量", "", "default", "treasure_sth", "138783"},
	[59305846]={ "40088", "宝箱", "神器能量", "", "default", "treasure_sth", "138783"},
	[78427138]={ "43307", "宝箱", "神器能量", "多场战斗", "default", "treasure_sth", "138783"},
	[50554125]={ "43246", "小宝箱", "神器能量", "", "default", "treasure_sth", "138783"},
	[39486518]={ "38486", "宝箱", "神器能量", "", "default", "treasure_sth", "138783"},
	[35176898]={ "38478", "小宝箱", "神器能量", "", "default", "treasure_sth", "138783"},
	[40656852]={ "38475", "小宝箱", "神器能量", "", "default", "treasure_sth", "138783"},
	[44166997]={ "38489", "小宝箱", "神器能量", "", "default", "treasure_sth", "138783"},
	[43708009]={ "43239", "小宝箱", "神器能量", "", "default", "treasure_sth", "138783"},
	[42336112]={ "38477", "小宝箱", "神器能量", "", "default", "treasure_sth", "138783"},
	[46606496]={ "38681", "小宝箱", "神器能量", "洞穴入口在 48.16 / 65.24", "default", "treasure_sth", "138783"},
	[49085999]={ "43207", "小宝箱", "神器能量", "", "default", "treasure_sth", "138783"},
	[47986237]={ "38738", "宝箱", "神器能量", "", "default", "treasure_sth", "138783"},
	[50061816]={ "43195", "宝箱", "神器能量", "", "default", "treasure_sth", "138783"},
	[49694731]={ "38763", "闪闪发光的宝箱", "神器能量", "准备与两个宝库管理者战斗", "default", "treasure_sth", "132897"},
	[53229314]={ "43190", "小宝箱", "神器能量", "", "default", "treasure_sth", "138783"},
	
	[40677238]={ "38424", "领主的蜜酒大厅", "玩具", "", "skull_grey", "rare_sth", "129113"},
	[38454305]={ "38626", "座狼群", "全能饰品", "", "skull_grey", "rare_sth", "129101"},
	[54802941]={ "42437", "Starbuck", "暴击/急速皮甲护腕", "", "skull_grey", "rare_sth", "130132"},
	[63707422]={ "37908", "马瑞斯与特德对审判官", "暴击/急速皮甲肩部", "", "skull_grey", "rare_sth", "140686"},
	[73454763]={ "40109", "考特·沃德尔", "急速/精通皮甲护腕", "", "skull_grey", "rare_sth", "138419"},
	[78626116]={ "40113", "征服者格古尔", "急速/精通锁甲腰带", "", "skull_grey", "rare_sth", "138421"},
	[36505250]={ "38472", "白水台风元素", "暴击/精通锁甲手套", "", "skull_grey", "rare_sth","138418"},
	[47174983]={ "38774", "迷路的双头怪", "力量饰品", "", "skull_grey", "rare_sth","129163"},
	[46828406]={ "38425", "法斯尼尔", "暴击戒指", "", "skull_grey", "rare_sth", "129206"},
	[64805176]={ "38847", "掠夺者乌格夫", "急速/精通布甲护腕", "", "skull_grey", "rare_sth","129219"},
	[73906060]={ "43343", "Dread-Rider Cortis", "急速/精通锁甲腿部", "", "skull_grey", "rare_sth","130134"},
	[62036049]={ "39120", "“大锤”伊赛尔", "暴击/急速锁甲头盔", "", "skull_grey", "rare_sth","129133"},
	[59826807]={ "39031", "白色哨兵", "精通饰品智力专属", "", "skull_grey", "rare_sth","132895"},
	[41476702]={ "38333", "葛利玛·铁拳", "暴击/精通板甲腰带", "", "skull_grey", "rare_sth","129291"},
	[49507175]={ "38423", "风暴之翼主母", "宠物", "", "skull_grey", "rare_sth","129208"},
	[51607465]={ "42591", "屠夫汉瓦尔", "暴击/精通皮甲胸部", "", "skull_grey", "rare_sth","138417"},
	[45877736]={ "38431", "风刀", "暴击/急速布甲胸部", "", "skull_grey", "rare_sth","129048"},
	[61534333]={ "40081", "塔本", "暴击/急速项链", "", "skull_grey", "rare_sth","129199"},
	[58004516]={ "38642", "冥口劫掠者", "急速/精通锁甲胸部", "", "skull_grey", "rare_sth","129123"},
	[58353392]={ "43342", "烂眼", "急速/精通锁甲腿部", "", "skull_grey", "rare_sth","139387"},
	[72504991]={ "38837", "莫多维乔", "精通/全能披风", "", "skull_grey", "rare_sth","129035"},
	[67303990]={ "38685", "无名君王", "急速/精通布甲头盔", "", "skull_grey", "rare_sth","129041"},
	[41773411]={ "40068", "不朽者埃格尔", "急速/精通板甲脚部", "", "skull_grey", "rare_sth", "132898"},
}

nodes["Suramar"] = {
	[23414880]={ "43842", "小宝箱", "神器能量", "", "default", "treasure_sur", "138783"},
	[25958548]={ "43831", "小宝箱", "神器能量", "", "default", "treasure_sur", "138783"},
	[29768817]={ "43748", "发光的远古魔力晶簇", "远古魔力", "", "default", "treasure_sur", "141655"},
	[38138712]={ "43830", "小宝箱", "神器能量", "", "default", "treasure_sur", "138783"},
	[51503859]={ "43855", "小宝箱", "神器能量", "", "default", "treasure_sur", "138783"},
	[46552599]={ "43744", "发光的远古魔力晶簇", "远古魔力", "", "default", "treasure_sur", "141655"},
	[52733130]={ "40767", "尘封保险箱", "神器能量", "", "default", "treasure_sur", "138783"},
	[44302289]={ "43850", "宝箱", "神器能量", "", "default", "treasure_sur", "138783"},
	[16602974]={ "43846", "小宝箱", "神器能量", "", "default", "treasure_sur", "138783"},
	[22863574]={ "43838", "法尔多拉神殿", "", "包含两个财宝", "default", "treasure_sur", ""},
	[21425446]={ "42842", "凯尔丹纳斯的法力瓶", "+100最大远古魔力", "", "default", "treasure_sur", "136269"},
	[17275462]={ "43844", "宝箱", "神器能量", "", "default", "treasure_sur", "138783"},
	[44053194]={ "43856", "闪闪发光的宝箱", "远古魔力", "洞穴入口在瀑布后面 42.25 / 29.97", "default", "treasure_sur", "139786"},
	[29271622]={ "43848", "宝箱", "神器能量/远古魔力等", "", "default", "treasure_sur", "138783"},
	[35561209]={ "43989", "奥术能量元件", "+100最大远古魔力", "", "default", "treasure_sur", "140329"},
	[41961919]={ "43746", "发光的远古魔力晶簇", "远古魔力", "", "default", "treasure_sur", "139786"},
	[42051968]={ "43849", "闪闪发光的宝箱", "远古魔力", "", "default", "treasure_sur", "139786"},
	[26831696]={ "43847", "小宝箱", "神器能量", "", "default", "treasure_sur", "138783"},
	[48143399]={ "43853", "小宝箱", "远古魔力", "", "default", "treasure_sur", ""},
	[67315511]={ "43858", "宝箱", "神器能量", "", "default", "treasure_sur", "138783"},
	[79647289]={ "43741", "发光的远古魔力晶簇", "远古魔力", "", "default", "treasure_sur", "141655"},
	[83126933]={ "43863", "宝箱", "神器能量", "", "default", "treasure_sur", "138783"},
	[83975764]={ "43862", "宝箱", "神器能量", "", "default", "treasure_sur", "138783"},
	[61365550]={ "43872", "宝箱", "神器能量", "", "default", "treasure_sur", "138783"},
	[54326033]={ "43875", "宝箱", "神器能量", "", "default", "treasure_sur", "138783"},
	[57686197]={ "43874", "宝箱", "神器能量", "", "default", "treasure_sur", "138783"},
	[57326039]={ "43873", "宝箱", "神器能量", "", "default", "treasure_sur", "138783"},
	[60356851]={ "43876", "闪闪发光的宝箱", "远古魔力", "", "default", "treasure_sur", "139786"},
	[49988493]={ "43864", "小宝箱", "神器能量", "需要使用房屋顶的抓点在 50.06 / 84.46", "default", "treasure_sur", "138783"},
	[48117321]={ "43865", "小宝箱", "神器能量", "有许多抓点在房间内", "default", "treasure_sur", "138783"},
	[48288261]={ "43866", "小宝箱", "神器能量", "需要使用房屋顶的抓点在 48.39 / 82.23", "default", "treasure_sur", "138783"},
	[48957379]={ "43867", "宝箱", "神器能量", "位于第二层。楼梯右侧", "default", "treasure_sur", "138783"},
	[51908214]={ "43868", "宝箱", "神器能量", "", "default", "treasure_sur", "138783"},
	[44387587]={ "43869", "小宝箱", "神器能量", "", "default", "treasure_sur", "138783"},
	[42577668]={ "43870", "小宝箱", "神器能量", "楼上卧室内", "default", "treasure_sur", "138783"},
	[48587217]={ "44323", "宝箱", "神器能量", "楼上左侧建筑物内", "default", "treasure_sur", "138783"},
	[50068061]={ "44325", "宝箱", "神器能量", "顶层建筑物内", "default", "treasure_sur", "138783"},
	[48297121]={ "44324", "宝箱", "神器能量", "跳上书架，宝物在到窗台右侧", "default", "treasure_sur", "138783"},
	[55685480]={ "43871", "小宝箱", "神器能量", "", "default", "treasure_sur", "138783"},
	[31956249]={ "43831", "小宝箱", "神器能量", "", "default", "treasure_sur", "138783"},
	[44803100]={ "43986", "魔化骨灰坛", "+100最大远古魔力", "", "default", "treasure_sur", "140326"},
	[26877073]={ "43987", "凯托斯的研究笔记", "+100最大远古魔力", "洞穴入口在 27.29 / 72.87", "default", "treasure_sur", "140327"},
	[76876150]={ "43860", "小宝箱", "神器能量", "在船只残骸上", "default", "treasure_sur", "138783"},
	[71464975]={ "43859", "小宝箱", "神器能量", "在塔顶", "default", "treasure_sur", "138783"},
	[52292990]={ "43854", "小宝箱", "神器能量", "洞穴入口在 49.5 / 33.9", "default", "treasure_sur", "138783"},
	[81965745]={ "43861", "小宝箱", "神器能量", "入口在 79.3 / 57.4", "default", "treasure_sur", "138783"},
	[63654911]={ "43857", "小宝箱", "神器能量", "", "default", "treasure_sur", "138783"},
	[19791604]={ "43845", "小宝箱", "神器能量", "洞穴入口在 19.4 / 19.4", "default", "treasure_sur", "138783"},
	[32277708]={ "43834", "宝箱", "神器能量", "只有在完成苏拉玛“突破碎光之地”任务支线后可用。另外不能使用在 31.0 / 85.1 的传送门", "default", "treasure_sur", "138783"},
	
	[24393517]={ "44071", "白狼玛亚", "暴击/急速披风", "", "skull_grey", "rare_sur", "139897"},
	[16532656]={ "43996", "影箭", "远古魔力", "", "skull_grey", "rare_sur", "140401"},
	[13535344]={ "44124", "马图拉", "远古魔力", "任务 ID 错误，与潮爪任务 ID 一致", "skull_grey", "rare_sur", "140949"},
	[18676104]={ "43542", "潮爪", "远古魔力", "", "skull_grey", "rare_sur", "140399"},
	[36183381]={ "43718", "主母哈佳萨", "远古魔力", "", "skull_grey", "rare_sur", "140390"},
	[33781509]={ "43717", "技师洛萨尔", "神器能量", "", "skull_grey", "rare_sur", "140372"},
	[75525729]={ "44003", "暗礁领主拉希斯", "急速/精通戒指", "", "skull_grey", "rare_sur", "121801"},
	[80157000]={ "40680", "洛克纳什", "暴击/急速板甲护腕", "在海沟中巡逻", "skull_grey", "rare_sur", "140019"},
	[67677106]={ "41136", "贪婪的哈克斯", "神器能量", "洞穴入口在 72.39 / 68.08", "skull_grey", "rare_sur", "140381"},
	[54435612]={ "43792", "德根", "敏捷饰品", "", "skull_grey", "rare_sur", "121808"},
	[54806376]={ "43794", "特使德温", "急速/精通布甲胸部", "", "skull_grey", "rare_sur", "139918"},
	[34176099]={ "43351", "腐蚀者马尔戴斯", "神器能量", "", "skull_grey", "rare_sur", "140386"},
	[62564808]={ "43495", "卡德乌斯", "暴击/急速锁甲头盔", "", "skull_grey", "rare_sur", "139969"},
	[61663958]={ "43993", "赫萨·格里姆多迪", "急速/精通锁甲脚部", "", "skull_grey", "rare_sur", "121737"},
	[68175896]={ "41135", "科拉卡", "暴击/精通皮甲胸部", "洞穴入口在 69.95 / 56.98", "skull_grey", "rare_sur", "139952"},
	[66656713]={ "43968", "钳胫", "玩具", "", "skull_grey", "rare_sur", "140314"},
	[40963282]={ "43358", "米奥妮克丝", "暴击/急速皮甲手套", "", "skull_grey", "rare_sur", "121739"},
	[33725123]={ "43954", "阿纳克斯", "宠物", "", "skull_grey", "rare_sur","140934"},
	[26104077]={ "42831", "沙兰", "急速/精通布甲护腕", "", "skull_grey", "rare_sur","139926"},
	[24574740]={ "43449", "邪恶的欧瑞斯", "神器能量", "", "skull_grey", "rare_sur","140388"},
	[22135178]={ "41319", "精灵灾星", "精通饰品力量专属", "", "skull_grey", "rare_sur","121806"},
	[87846248]={ "41786", "莫格拉什国王", "神器能量", "", "skull_grey", "rare_sur", "140384"},
	[38042278]={ "43369", "攻城大师艾丁", "远古魔力", "", "skull_grey", "rare_sur", "140406"},
	[53193021]={ "40897", "加弗鲁格", "暴击/精通锁甲肩部", "", "skull_grey", "rare_sur", "121755"},
	[42175641]={ "43580", "药剂师法德伦", "暴击/精通布甲肩部", "", "skull_grey", "rare_sur", "121754"},
	[48075637]={ "40905", "斯塔瑟玛中尉", "暴击/精通板甲脚部", "", "skull_grey", "rare_sur", "121735"},
	--[67065161]={ "99999", "Broodmother Shu'malis", "职业大厅资源", "标记为稀有但是看起来还没有任务 ID", "skull_grey", "rare_sur", "1220"},
	[27776547]={ "43992", "高格罗斯", "暴击/急速板甲腿部", "点击传送门钥匙", "skull_grey", "rare_sur", "121747"},
	[62506369]={ "43793", "米娅苏", "急速饰品", "", "skull_grey", "rare_sur", "121810"},
	[65575914]={ "43481", "奥术师莉兰德", "远古魔力", "", "skull_grey", "rare_sur", "140403"},
	[61015298]={ "43597", "卫兵索艾尔", "远古魔力", "小范围巡逻", "skull_grey", "rare_sur", "140404"},
	[49607900]={ "43603", "兰德尔", "神器能量", "", "skull_grey", "rare_sur", "140396"},
	[24052542]={ "43484", "劳伦", "急速/精通皮甲腰带", "", "skull_grey", "rare_sur", "121759"},
	[42058005]={ "43348", "魔导师法蒂斯", "远古魔力", "", "skull_grey", "rare_sur", "140405"},
	[29395330]={ "44676", "洛瑞安", "神器能量", "洞穴入口在 29.29 / 50.71", "skull_grey", "rare_sur", "138839"},
	[35236723]={ "44675", "瑞瓦塔丝夫人", "全能/精通布甲手套", "", "skull_grey", "rare_sur", "141866"},
}

nodes["Darkpens"] = {
	[42018849]={ "39085", "小宝箱", "神器能量", "入口在墙面上部 41.4 / 45.6", "default", "treasure_val","138783"},
	[50905168]={ "39086", "闪闪发光的宝箱", "神器能量", "入口在墙面上部 41.4 / 45.6", "default", "treasure_val","138783"},
}

nodes["OceanusCove"] = {
	[69294839]={ "37649", "闪闪发光的宝箱", "神器能量", "", "default", "treasure_azs", "138783"},
	[45346686]={ "42291", "小宝箱", "神器能量", "", "default", "treasure_azs", "138783"},
}

nodes["BitestoneEnclave"] = {
	[85213787]={ "40489", "宝箱", "神器能量", "", "default", "treasure_hmn", "138783"},
}

nodes["LifespringCavern"] = {
	[53102392]={ "40476", "闪闪发光的宝箱", "神器能量", "", "default", "treasure_hmn", "138783"},
}

nodes["Helheim"] = {
	[85085031]={ "38461", "芬里", "精通饰品", "", "skull_grey", "rare_sth", "129044"},
	[28186375]={ "39870", "吸魂者", "宠物", "", "skull_grey", "rare_sth", "129188"},
	[79842471]={ "38510", "宝箱", "神器能量", "", "default", "treasure_sth", "138783"},
	[83322456]={ "38503", "宝箱", "神器能量", "水下沉船中", "default", "treasure_sth", "138783"},
	[60845332]={ "38383", "宝箱", "神器能量", "", "default", "treasure_sth", "138783"},
	[19634698]={ "38516", "宝箱", "神器能量", "", "default", "treasure_sth", "138783"},
}

nodes["ThunderTotem"] = {
	[13715555]={ "40491", "小宝箱", "神器能量", "", "default", "treasure_hmn", "138783"},
	[63435929]={ "39531", "潮湿的珠宝盒", "垃圾", "", "default", "treasure_hmn", "141322"},
	[50667537]={ "40472", "小宝箱", "神器能量", "", "default", "treasure_hmn", "138783"},
	[32354174]={ "40475", "小宝箱", "神器能量", "", "default", "treasure_hmn", "138783"},
	[31843842]={ "44352", "宝箱", "神器能量", "在水下洞穴内", "default", "treasure_hmn", "138783"},
}

nodes["ThunderTotemInterior"] = {
	[62946793]={ "40471", "宝箱", "神器能量", "", "default", "treasure_hmn", "138783"},
}

nodes["NeltharionsVault"] = {
	[63733725]={ "39606", "死亡之翼宝箱", "神器能量", "使用洞穴底部的泰坦传送门触发事件", "default", "treasure_hmn", "138783"},
	[40215031]={ "40509", "宝箱", "神器能量", "", "default", "treasure_hmn", "138783"},
	[60425458]={ "40508", "小宝箱", "神器能量", "", "default", "treasure_hmn", "138783"},
}

nodes["SuramarLegionScar"] = {
	[40502903]={ "40902", "小宝箱", "神器能量", "", "default", "treasure_sur", "138783"},
	[54573780]={ "43835", "小宝箱", "神器能量", "", "default", "treasure_sur", "138783"},
}

nodes["StonedarkGrotto"] = {
	[35987235]={ "40478", "宝箱", "神器能量", "", "default", "treasure_hmn", "138783"},
}

nodes["MucksnoutDen"] = {
	[60592533]={ "40494", "宝箱", "神器能量", "", "default", "treasure_hmn", "138783"},
}


nodes["MardumtheShatteredAbyss"] = {
	[34857020]={ "39970", "小宝箱", "", "", "default", "treasure_dh", "129210"},
	[45017785]={ "39971", "小宝箱", "可重复使用药水", "", "default", "treasure_dh", "129192"},
	[41763761]={ "40759", "小宝箱", "", "", "default", "treasure_dh", "129196"},
	[51135079]={ "40743", "小宝箱", "", "", "default", "treasure_dh", "129210"},
	[76243899]={ "40338", "小宝箱", "", "洞穴入口在 77.0 / 41.4", "default", "treasure_dh", "129210"},
	[82075043]={ "40820", "小宝箱", "", "", "default", "treasure_dh", "129196"},
	[78755047]={ "40274", "小宝箱", "", "", "default", "treasure_dh", "129210"},
	[73494892]={ "39975", "小宝箱", "", "", "default", "treasure_dh", "129195"},
	[42194916]={ "40223", "小宝箱", "", "", "default", "treasure_dh", "129210"},
	[23065389]={ "40797", "小宝箱", "", "洞穴入口在 23.6 / 54.2", "default", "treasure_dh", "129210"},
	[66922767]={ "39974", "小宝箱", "", "", "default", "treasure_dh", "129210"},
	[74285453]={ "39977", "小宝箱", "", "洞穴入口在 70.7 / 54.0", "default", "treasure_dh", "129210"},
	[69704240]={ "39976", "小宝箱", "", "", "default", "treasure_dh", "129210"},
	
	[68852759]={ "40234", "沃罗斯将军", "", "", "skull_grey", "rare_dh", "128947"},
	[81034124]={ "40233", "工头布鲁塔格", "", "", "skull_grey", "rare_dh", "133580"},
	[74475731]={ "40232", "蛛王沃拉斯", "", "", "skull_grey", "rare_dh", "128944"},
}

nodes["CrypticHollow"] = {
	[48761530]={ "39972", "小宝箱", "", "", "default", "treasure_dh", "129196"},
	[54855845]={ "39973", "小宝箱", "", "", "default", "treasure_dh", "128946"},
}

nodes["SoulEngine"] = {
	[50304964]={ "40772", "小宝箱", "", "", "default", "treasure_dh", "129210"},
	[51235740]={ "40231", "Count Nefarious", "", "", "skull_grey", "rare_dh", "128948"},
}

nodes["VaultOfTheWardensDH"] = {
	[58693475]={ "40909", "小宝箱", "", "第一层", "default", "treasure_dh", "129210"},
	[47325464]={ "38690", "小宝箱", "", "第一层", "default", "treasure_dh", "129210"},
	[32104817]={ "40911", "小宝箱", "", "第二层", "default", "treasure_dh", "129196"},
	[41506361]={ "40914", "小宝箱", "", "第二层", "default", "treasure_dh", "129196"},
	[56994013]={ "40913", "小宝箱", "", "第二层", "default", "treasure_dh", "129210"},
	[41413287]={ "40912", "小宝箱", "", "第二层", "default", "treasure_dh", "129210"},
	[24421005]={ "40915", "小宝箱", "", "第三层", "default", "treasure_dh", "129210"},
	[23268157]={ "40916", "小宝箱", "", "第三层", "default", "treasure_dh", "129210"},
	
	[68743628]={ "40301", "愤怒领主勒考斯", "", "", "skull_grey", "rare_dh", "128958"},
	[49543284]={ "40251", "科斯拉佐", "", "", "skull_grey", "rare_dh", "128945"},
}

nodes["StormDrakeDen"] = {
	[20134125]={ "38529", "宝箱", "神器能量", "", "default", "treasure_sth", "138783"},
}

nodes["NarthalasAcademy"] = {
	[53643981]={ "42284", "小宝箱", "神器能量", "神殿内", "default", "treasure_azs", "138783"},
	[54413487]={ "42285", "小宝箱", "神器能量", "需要任务线开启门获取财宝You need to do a questline to open the door leading to the treasure", "default", "treasure_azs", "138783"},
}

nodes["FalanaarTunnels"] = {
	[35513253]={ "43747", "发光的远古魔力晶簇", "远古魔力", "", "default", "treasure_sur", "139786"},
	[48644258]={ "43839", "小宝箱", "神器能量", "从蛛网爬上高台以获取", "default", "treasure_sur", "138783"},
	[23354815]={ "43840", "宝箱", "神器能量", "", "default", "treasure_sur", "138783"},
	[35525280]={ "43988", "不稳定的魔网水晶", "+100最大远古魔力", "bottom floor", "default", "treasure_sur", "140328"},
	[38605414]={ "43838", "小宝箱", "神器能量", "法兰多尔底层", "default", "treasure_sur", "138783"},
}


if (PlayerFaction == "Alliance") then
  nodes["Stormheim"][44202296]={ "38630", "Horde Kill Squad", "暴击/全能板甲手套", "只限联盟", "skull_grey", "rare_sth", "129266"}
  nodes["Stormheim"][42015767]={ "38625", "Hook and Sinker", "暴击/精通布甲腰带", "", "skull_grey", "rare_sth", "129100"}
end

if (PlayerFaction == "Horde") then
  nodes["Stormheim"][44202296]={ "38627", "Worgen Stalkers", "暴击/精通板甲手套", "只限部落", "skull_grey", "rare_sth", "129264"}
  nodes["Stormheim"][47205710]={ "38712", "Houndmaster Ely", "急速/精通布甲腿部", "", "skull_grey", "rare_sth", "129037"}
end

local function GetItem(ID)
    if (ID == "1220") then
        local currency, _, _ = GetCurrencyInfo(ID)

        if (currency ~= nil) then
            return currency
        else
            return "货币 ID 载入错误"
        end
    else
        local _, item, _, _, _, _, _, _, _, _ = GetItemInfo(ID)

        if (item ~= nil) then
            return item
        else
            return "物品 ID 载入错误"
        end
    end
end 

local function GetIcon(ID)
    if (ID == "1220") then
        local _, _, icon = GetCurrencyInfo(ID)

        if (icon ~= nil) then
            return icon
        else
            return "Interface\\Icons\\inv_misc_questionmark"
        end
    else
		local _, _, _, _, icon = GetItemInfoInstant(ID)
        --local _, _, _, _, _, _, _, _, _, icon = GetItemInfo(ID)

        if (icon ~= nil) then
            return icon
        else
            return "Interface\\Icons\\inv_misc_questionmark"
        end
    end
end

function LegionRaresTreasures:OnEnter(mapFile, coord)
    if (not nodes[mapFile][coord]) then return end
    
    local tooltip = self:GetParent() == WorldMapButton and WorldMapTooltip or GameTooltip

    if ( self:GetCenter() > UIParent:GetCenter() ) then
        tooltip:SetOwner(self, "ANCHOR_LEFT")
    else
        tooltip:SetOwner(self, "ANCHOR_RIGHT")
    end

    tooltip:SetText(nodes[mapFile][coord][2])
    if (nodes[mapFile][coord][3] ~= nil) and (LegionRaresTreasures.db.profile.show_loot == true) then
        if ((nodes[mapFile][coord][7] ~= nil) and (nodes[mapFile][coord][7] ~= "")) then
            tooltip:AddLine(("掉落：" .. GetItem(nodes[mapFile][coord][7])), nil, nil, nil, true)

            if ((nodes[mapFile][coord][3] ~= nil) and (nodes[mapFile][coord][3] ~= "")) then
                tooltip:AddLine(("掉落信息：" .. nodes[mapFile][coord][3]), nil, nil, nil, true)
            end
        else
            tooltip:AddLine(("掉落：" .. nodes[mapFile][coord][3]), nil, nil, nil, true)
        end
    end

    if (nodes[mapFile][coord][4] ~= "") and (LegionRaresTreasures.db.profile.show_notes == true) then
     tooltip:AddLine(("注释：" .. nodes[mapFile][coord][4]), nil, nil, nil, true)
    end

    tooltip:Show()
end

local isMoving = false
local info = {}
local clickedMapFile = nil
local clickedCoord = nil

local function generateMenu(button, level)
    if (not level) then return end

    for k in pairs(info) do info[k] = nil end

    if (level == 1) then
        info.isTitle = 1
        info.text = "LegionRaresTreasures"
        info.notCheckable = 1
        UIDropDownMenu_AddButton(info, level)
        
        info.disabled = nil
        info.isTitle = nil
        info.notCheckable = nil
        info.text = "从地图上移除此物件"
        info.func = LRTDisableTreasure
        info.arg1 = clickedMapFile
        info.arg2 = clickedCoord
        UIDropDownMenu_AddButton(info, level)
        
        if isTomTomloaded == true then
            info.text = "在 TomTom 添加此路径点位置"
            info.func = LRTaddtoTomTom
            info.arg1 = clickedMapFile
            info.arg2 = clickedCoord
            UIDropDownMenu_AddButton(info, level)
        end

        if isDBMloaded == true then
            info.text = "在 DBM 中添加此财宝箭头"
            info.func = LRTAddDBMArrow
            info.arg1 = clickedMapFile
            info.arg2 = clickedCoord
            UIDropDownMenu_AddButton(info, level)
            
            info.text = "隐藏 DBM 箭头"
            info.func = LRTHideDBMArrow
            UIDropDownMenu_AddButton(info, level)
        end

        info.text = CLOSE
        info.func = function() CloseDropDownMenus() end
        info.arg1 = nil
        info.arg2 = nil
        info.notCheckable = 1
        UIDropDownMenu_AddButton(info, level)

        info.text = "恢复已移除物件"
        info.func = LRTResetDB
        info.arg1 = nil
        info.arg2 = nil
        info.notCheckable = 1
        UIDropDownMenu_AddButton(info, level)
        
    end
end

local HandyNotes_LegionRaresTreasuresDropdownMenu = CreateFrame("Frame", "HandyNotes_LegionRaresTreasuresDropdownMenu")
HandyNotes_LegionRaresTreasuresDropdownMenu.displayMode = "MENU"
HandyNotes_LegionRaresTreasuresDropdownMenu.initialize = generateMenu

function LegionRaresTreasures:OnClick(button, down, mapFile, coord)
    if button == "RightButton" and down then
        clickedMapFile = mapFile
        clickedCoord = coord
        ToggleDropDownMenu(1, nil, HandyNotes_LegionRaresTreasuresDropdownMenu, self, 0, 0)
    end
end

function LegionRaresTreasures:OnLeave(mapFile, coord)
    if self:GetParent() == WorldMapButton then
        WorldMapTooltip:Hide()
    else
        GameTooltip:Hide()
    end
end

local options = {
    type = "group",
    name = "军团再临稀有和财宝",
    desc = "破碎群岛稀有和财宝位置",
    get = function(info) return LegionRaresTreasures.db.profile[info.arg] end,
    set = function(info, v) LegionRaresTreasures.db.profile[info.arg] = v; LegionRaresTreasures:Refresh() end,
    args = {
        desc = {
            name = "常用设置",
            type = "description",
            order = 0,
        },
        icon_scale_treasures = {
            type = "range",
            name = "财宝图标大小",
            desc = "图标的大小",
            min = 0.25, max = 3, step = 0.01,
            arg = "icon_scale_treasures",
            order = 1,
        },
        icon_scale_rares = {
            type = "range",
            name = "稀有图标大小",
            desc = "图标的大小",
            min = 0.25, max = 3, step = 0.01,
            arg = "icon_scale_rares",
            order = 2,
        },
        icon_alpha = {
            type = "range",
            name = "图标透明度",
            desc = "图标的透明度",
            min = 0, max = 1, step = 0.01,
            arg = "icon_alpha",
            order = 20,
        },
        VisibilityOptions = {
            type = "group",
            name = "可见性设定",
            desc = "可见性设定",
            args = {
                VisibilityGroup = {
                    type = "group",
                    order = 0,
                    name = "选择哪些区域要显示什么：",
                    inline = true,
                    args = {
                        groupAZS = {
                            type = "header",
                            name = "阿苏纳",
                            desc = "阿苏纳",
                            order = 0,
                        },
                        treasureAZS = {
                            type = "toggle",
                            arg = "treasure_azs",
                            name = "财宝",
                            desc = "财宝会提供很多物品",
                            order = 1,
                            width = "normal",
                        },
                        rareAZS = {
                            type = "toggle",
                            arg = "rare_azs",
                            name = "稀有",
                            desc = "稀有刷新",
                            order = 2,
                            width = "normal",
                        },
                        groupVAL = {
                            type = "header",
                            name = "瓦尔莎拉",
                            desc = "瓦尔莎拉",
                            order = 10,
                        },  
                        treasureVAL = {
                            type = "toggle",
                            arg = "treasure_val",
                            name = "财宝",
                            desc = "财宝会提供很多物品",
                            width = "normal",
                            order = 11,
                        },
                        rareVAL = {
                            type = "toggle",
                            arg = "rare_val",
                            name = "稀有",
                            desc = "稀有刷新",
                            width = "normal",
                            order = 12,
                        },
                        groupHMN = {
                            type = "header",
                            name = "至高岭",
                            desc = "至高岭",
                            order = 20,
                        },  
                        treasureHMN = {
                            type = "toggle",
                            arg = "treasure_hmn",
                            name = "财宝",
                            desc = "财宝会提供很多物品",
                            width = "normal",
                            order = 21,
                        },
                        rareHMN = {
                            type = "toggle",
                            arg = "rare_hmn",
                            name = "稀有",
                            desc = "稀有刷新",
                            width = "normal",
                            order = 22,
                        },  
                        groupSTH = {
                            type = "header",
                            name = "风暴峡湾",
                            desc = "风暴峡湾",
                            order = 30,
                        },  
                        treasureSTH = {
                            type = "toggle",
                            arg = "treasure_sth",
                            name = "财宝",
                            desc = "财宝会提供很多物品",
                            width = "normal",
                            order = 31,
                        },
                        rareSTH = {
                            type = "toggle",
                            arg = "rare_sth",
                            name = "稀有",
                            desc = "稀有刷新",
                            width = "normal",
                            order = 32,
                        },  
                        groupSUR = {
                            type = "header",
                            name = "苏拉玛",
                            desc = "苏拉玛",
                            order = 40,
                        },    
                        treasureSUR = {
                            type = "toggle",
                            arg = "treasure_sur",
                            name = "财宝",
                            desc = "财宝会提供很多物品",
                            width = "normal",
                            order = 41,
                        },
                        rareSUR = {
                            type = "toggle",
                            arg = "rare_sur",
                            name = "稀有",
                            desc = "稀有刷新",
                            width = "normal",
                            order = 42,
                        },
						groupDH = {
                            type = "header",
                            name = "恶魔猎手",
                            desc = "只在恶魔猎手区域",
                            order = 50,
                        },    
                        treasureDH = {
                            type = "toggle",
                            arg = "treasure_dh",
                            name = "财宝",
                            desc = "财宝会提供很多物品",
                            width = "normal",
                            order = 51,
                        },
                        rareDH = {
                            type = "toggle",
                            arg = "rare_dh",
                            name = "稀有",
                            desc = "稀有刷新",
                            width = "normal",
                            order = 52,
                        },  						
                    },
                },
                alwaysshowrares = {
                    type = "toggle",
                    arg = "alwaysshowrares",
                    name = "总是显示已拾取的稀有",
                    desc = "显示每个稀有无论是否已拾取状态",
                    order = 100,
                    width = "full",
                },
                alwaysshowtreasures = {
                    type = "toggle",
                    arg = "alwaysshowtreasures",
                    name = "总是显示已拾取的财宝",
                    desc = "显示每个财宝无论是否已拾取状态",
                    order = 101,
                    width = "full",
                },
                show_loot = {
                    type = "toggle",
                    arg = "show_loot",
                    name = "显示掉落",
                    desc = "显示每个财宝/稀有的掉落",
                    order = 102,
                },
                show_notes = {
                    type = "toggle",
                    arg = "show_notes",
                    name = "显示注释",
                    desc = "当可用时显示每个财宝/稀有的注释",
                    order = 103,
                },
            },
        },
    },
}

function LegionRaresTreasures:OnInitialize()
    local defaults = {
        profile = {
            icon_scale_treasures = 1.5,
            icon_scale_rares = 2.0,
            icon_alpha = 1.00,
            alwaysshowrares = false,
            alwaysshowtreasures = false,
            save = true,
            treasure_azs = true,
            treasure_val = true,
            treasure_hmn = true,
            treasure_sth = true,
            treasure_sur = true,
			treasure_dh = true,
            rare_azs = true,
            rare_val = true,
            rare_hmn = true,
			rare_sth = true,
            rare_sur = true,
			rare_dh = true,
            show_loot = true,
            show_notes = true,
        },
    }

    self.db = LibStub("AceDB-3.0"):New("LegionRaresTreasuresDB", defaults, "Default")
    self:RegisterEvent("PLAYER_ENTERING_WORLD", "WorldEnter")
end

function LegionRaresTreasures:WorldEnter()
    self:UnregisterEvent("PLAYER_ENTERING_WORLD")
	self:ScheduleTimer("QuestCheck", 5)
    self:ScheduleTimer("RegisterWithHandyNotes", 8)
	self:ScheduleTimer("LoadCheck", 6)
end

function LegionRaresTreasures:QuestCheck()
    do
		if (IsQuestFlaggedCompleted(41246)) then
			nodes["Highmountain"][52556638]={ "42453", "宝箱", "神器能量", "只有在至高岭完成至高岭营地任务线才可到达。", "default", "treasure_hmn", "138783"}
		end
    end
end

function LegionRaresTreasures:RegisterWithHandyNotes()
    do
        local function iter(t, prestate)
            if not t then return nil end

            local state, value = next(t, prestate)

            while state do

                -- QuestID[1], Name[2], Loot[3], Notes[4], Icon[5], Tag[6], ItemID[7]
                if (value[1] and self.db.profile[value[6]] and not LegionRaresTreasures:HasBeenLooted(value)) then
                    if ((value[7] ~= nil) and (value[7] ~= "")) then
                        GetIcon(value[7]) --this should precache the Item, so that the loot is correctly returned
                    end

                    if ((value[5] == "default") or (value[5] == "unknown")) then
                        if ((value[7] ~= nil) and (value[7] ~= "")) then
                            return state, nil, GetIcon(value[7]), LegionRaresTreasures.db.profile.icon_scale_treasures, LegionRaresTreasures.db.profile.icon_alpha
                        else
                            return state, nil, iconDefaults[value[5]], LegionRaresTreasures.db.profile.icon_scale_treasures, LegionRaresTreasures.db.profile.icon_alpha
                        end
                    end

                    return state, nil, iconDefaults[value[5]], LegionRaresTreasures.db.profile.icon_scale_rares, LegionRaresTreasures.db.profile.icon_alpha
                end

                state, value = next(t, state)
            end
        end

        function LegionRaresTreasures:GetNodes(mapFile, isMinimapUpdate, dungeonLevel)
            return iter, nodes[mapFile], nil
        end
    end

    HandyNotes:RegisterPluginDB("LegionRaresTreasures", self, options)
    self:RegisterBucketEvent({ "LOOT_CLOSED" }, 2, "Refresh")
    self:Refresh()
end
 
function LegionRaresTreasures:Refresh()
    self:SendMessage("HandyNotes_NotifyUpdate", "LegionRaresTreasures")
end

function LRTResetDB()
    table.wipe(LegionRaresTreasures.db.char)
    LegionRaresTreasures:Refresh()
end

function LegionRaresTreasures:HasBeenLooted(value)
    if (self.db.profile.alwaysshowtreasures and (string.find(value[6], "treasure") ~= nil)) then return false end
    if (self.db.profile.alwaysshowrares and (string.find(value[6], "treasure") == nil)) then return false end
    if (LegionRaresTreasures.db.char[value[1]] and self.db.profile.save) then return true end
    if (IsQuestFlaggedCompleted(value[1])) then
        return true
    end

    return false
end

function LRTDisableTreasure(button, mapFile, coord)
    if (nodes[mapFile][coord][1] ~= nil) then
        LegionRaresTreasures.db.char[nodes[mapFile][coord][1]] = true;
    end

    LegionRaresTreasures:Refresh()
end

function LRTaddtoTomTom(button, mapFile, coord)
    if isTomTomloaded == true then
        local mapId = HandyNotes:GetMapFiletoMapID(mapFile)
        local x, y = HandyNotes:getXY(coord)
        local desc = nodes[mapFile][coord][2];

        if (nodes[mapFile][coord][3] ~= nil) and (LegionRaresTreasures.db.profile.show_loot == true) then
            if ((nodes[mapFile][coord][7] ~= nil) and (nodes[mapFile][coord][7] ~= "")) then
                desc = desc.."\n掉落：" .. GetItem(nodes[mapFile][coord][7]);
                desc = desc.."\n掉落信息：" .. nodes[mapFile][coord][3];
            else
                desc = desc.."\n掉落：" .. nodes[mapFile][coord][3];
            end
        end

        if (nodes[mapFile][coord][4] ~= "") and (LegionRaresTreasures.db.profile.show_notes == true) then
            desc = desc.."\n注释：" .. nodes[mapFile][coord][4]
        end

        TomTom:AddMFWaypoint(mapId, nil, x, y, {
            title = desc,
            persistent = nil,
            minimap = true,
            world = true
        })
    end
end

function LRTAddDBMArrow(button, mapFile, coord)
    if isDBMloaded == true then
        local mapId = HandyNotes:GetMapFiletoMapID(mapFile)
        local x, y = HandyNotes:getXY(coord)
        local desc = nodes[mapFile][coord][2];

        if (nodes[mapFile][coord][3] ~= nil) and (LegionRaresTreasures.db.profile.show_loot == true) then
            if ((nodes[mapFile][coord][7] ~= nil) and (nodes[mapFile][coord][7] ~= "")) then
                desc = desc.."\n掉落：" .. GetItem(nodes[mapFile][coord][7]);
                desc = desc.."\n掉落信息：" .. nodes[mapFile][coord][3];
            else
                desc = desc.."\n掉落：" .. nodes[mapFile][coord][3];
            end
        end

        if (nodes[mapFile][coord][4] ~= "") and (LegionRaresTreasures.db.profile.show_notes == true) then
            desc = desc.."\n注释：" .. nodes[mapFile][coord][4]
        end

        if not DBMArrow.Desc:IsShown() then
            DBMArrow.Desc:Show()
        end

        x = x*100
        y = y*100
        DBMArrow.Desc:SetText(desc)
        DBM.Arrow:ShowRunTo(x, y, nil, nil, true)
    end
end

function LRTHideDBMArrow()
    DBM.Arrow:Hide(true)
end

function LegionRaresTreasures:LoadCheck()
	if (IsAddOnLoaded("TomTom")) then 
		isTomTomloaded = true
	end

	if (IsAddOnLoaded("DBM-Core")) then 
		isDBMloaded = true
	end

	if isDBMloaded == true then
		local ArrowDesc = DBMArrow:CreateFontString(nil, "OVERLAY", "GameTooltipText")
		ArrowDesc:SetWidth(400)
		ArrowDesc:SetHeight(100)
		ArrowDesc:SetPoint("CENTER", DBMArrow, "CENTER", 0, -35)
		ArrowDesc:SetTextColor(1, 1, 1, 1)
		ArrowDesc:SetJustifyH("CENTER")
		DBMArrow.Desc = ArrowDesc
	end
end
