U1Donators = {}
U1Donators.players = {["2018-08-02"] = {["白银之手"] = "高大的番茄,柯熙",["凤凰之神"] = "陌问,森森呀",["格瑞姆巴托"] = "黎明之钟,炮卍神,浪花",["龙骨平原"] = "阿兰提尔",["罗宁"] = "胖可丁的忧伤",["伊森利恩"] = "一直向西",["死亡之翼"] = "半藏小公举,火怒风",["扎拉赞恩"] = "牛德樺",["图拉扬"] = "面啵",["玛多兰"] = "暴风真神",["无尽之海"] = "有文化有盗德",["安苏"] = "偷驴他拔",["芬里斯"] = "阿良",["国王之谷"] = "木忆",["黑暗虚空"] = "不能叫我山鸡",["圣火神殿"] = "莫利亞"},["2018-08-01"] = {["无尽之海"] = "灬柳暗花亦明,短腿肥牛,酷猫六号,苍穹灬布林顿,纤弦月",["奥拉基尔"] = "Sevennine",["戈古纳斯"] = "心如紫水,碎玻璃一地",["凤凰之神"] = "逆命,达瓦里希,钰九涵,蜘蛛丶侦探,陈伯,固穷者乂酒仙,逗比小僧,曾经那么美,风中星痕,说你笨还顶嘴,说你笨还顶嘴,良言",["???"] = "Sevennine,关羽字云长,秋刀鱼的春天,基爱崖首席暴白,Famoni,虞松杰,绽放的微笑,玛露希露,笙希丶",["国王之谷"] = "忧郁智天使,橙十三火锅,造化自然,江阴帝侃",["主宰之剑"] = "丷阿尓萨斯,嘀哩哩咑咑,丝黛芬妮,思维魔方,玲珑月来香,Suidream,不可胜术",["末日祷告祭坛"] = "覃布丁",["罗宁"] = "奥伦希尔莉,飄緲,泠邪,刘先森,篂篂,Atherden,君王之灾,潇潇易水寒,落落萧萧,吉尔娜斯,冬冬小宝宝,搞不死的小强",["瑟莱德丝"] = "泡泡美女",["翡翠梦境"] = "审判的温柔,Schrödinger,花开不在",["安苏"] = "洒灬脱,粥行者,参宿,Zaracon,超光速猪蛛侠,有事你先上,红人沙加,筱猪,鬼雪秋水,吾自醉丶,御宴蛋炒飯,丨聖鬥仕丨,Mocktail,光铸馒头",["贫瘠之地"] = "糖泡泡糖,鬼灯芥子,帅气的羊爸,追梦少年,模犯生,神徽羽,我吸一口,凉城梦境,逍遥小猫,有止境",["燃烧之刃"] = "Redalax,Lewandowska,倚楼观风雨",["德拉诺"] = "粉木耳历险记,Ugmlls",["丽丽（四川）"] = "纳兰香雪,Dreamwalk",["迦拉克隆"] = "兮檬,伊拉瑞安,明镜止水,曲终秂未散",["火烟之谷"] = "云刀断月",["血色十字军"] = "曲无忆,晨谜于你,伶牙,苏大诗人,盘古之刃,遁入虚空,寂寞狩猎,掷酒,郭哥,熵焱,迷路的小姐姐",["熔火之心"] = "田全蛋,蒙特",["末日行者"] = "萝卜萝卜卜,亲爱的不二,莫流求,亡術,Vensy,壹箭倾城",["死亡之翼"] = "毒液炸彈,情舒灬,宁宁他爹,已走很远,萌萌的尐熊猫,萌萌的尐熊猫,顺丰速运,夜忧,冬天的我们,我就是小法,你喜欢花吗,猫的报恩,大猫有点皮,陈浩南,邪风冷羽",["格瑞姆巴托"] = "阿克酥德,一卦定天下,独行三瘋",["艾维娜"] = "枫苍龙",["白银之手"] = "盘溪风月,寒池飘雪,简小洛,野萧遐,听到风潮,月行丶,可布丶,暗夜德传说,幻雨悯筱,很紧,Aztecs,沉默的回忆,墨文,纹身小绵羊,半壶酒,火的冰点,西铁成,蜚语流言,听过的故事,昔昔的,时光,米七七丶,退堂鼓大师,刀锋战士,永恒礼赞,迷人的圆滚滚",["回音山"] = "依末,若丶年華倒带,你贼猴了,逗莎包,炫炫丶天蝎座,灵魂的气息",["伊瑟拉"] = "Akermend",["扎拉赞恩"] = "原纱央莉,泰勒将军",["守护之剑"] = "专射娘子",["诺森德"] = "小图腾,袜子哥哥",["巴瑟拉斯"] = "Sariell,人字拖大魔王",["血环"] = "Mn,罗夏德拉",["安东尼达斯"] = "可能的",["影之哀伤"] = "星怜,打的低,沐晨殇,睡觉的星,鲸海,疯狂魅影丶,雾里看小花,殺画丶,此生唯伊",["万色星辰"] = "无敌大萌王,紫游,Biubiupiapia",["死亡熔炉"] = "Kurisu,夏沐清風",["朵丹尼尔"] = "咖啡苹果茶,贪玩蓝月",["菲米丝"] = "牵手丶,手抓饼十个蛋",["诺兹多姆"] = "无影剑艾雷诺,水沝淼淼",["奥特兰克"] = "蜉蝣,大道无痕,Skyland",["麦维影歌"] = "非尼克斯",["山丘之王"] = "牧神灬晨光,湛卢,小小奶黄包,Demhut",["玛里苟斯"] = "黎风丶维诺,深蓝胖胖",["白骨荒野"] = "一只大老虎",["火喉"] = "溪流柳",["远古海滩"] = "烧烤大咕咕",["伊利丹"] = "路痴慕斯",["火羽山"] = "Wonderfuleeg",["安其拉"] = "好气哦",["泰兰德"] = "Hunshaw",["亚雷戈斯"] = "安联的夏天,泡的饭饭,浅斟低唱,埃辛诺斯壁垒,杨颖,箭弹擒心",["奥妮克希亚"] = "索利达尔之怒",["克洛玛古斯"] = "琥珀色眼眸",["玛洛加尔"] = "雪若花凋",["水晶之刺[TW]"] = "新语面包",["伊森利恩"] = "筱豆豆,丨抖妇乳、,我来秀底线",["雷斧堡垒"] = "捌拐洞捌拐,真的哈呼",["阿克蒙德"] = "Ebonstorm",["加兹鲁维"] = "冰枫月影",["艾萨拉"] = "天亮要睁眼",["克苏恩"] = "凯丹",["破碎岭"] = "迈克尔丶春丽,最爱记忆",["狂熱之刃[TW]"] = "搖曳靈光",["拉文凯斯"] = "为了部落,深紫厄苏拉,慕尼黑啤酒",["自由之风"] = "Alive",["轻风之语"] = "爱无言",["梅尔加尼"] = "云中燕",["蜘蛛王国"] = "牛排嫩嫩的",["熊猫酒仙"] = "満岛光,大姨妈之盾,扎木卡,清风忍",["海克泰尔"] = "曹飞彪,妖花,情长纸短",["壁炉谷"] = "下面一点红,龙纹灬邪刃",["达文格尔"] = "小猪维妮",["圣火神殿"] = "快乐阿杭",["加尔"] = "快到兜里来,孢子蝠",["烈焰峰"] = "暴力军官",["耳语海岸"] = "夏天,夏天",["霜狼"] = "哥哥嫌你脏,高坂穗乃果,园田海未",["达尔坎"] = "深红",["血吼"] = "原則,Canon,零落花如许",["神圣之歌"] = "海上生明月灬,那年夜下吻",["金色平原"] = "伊露恩丶星光",["阿纳克洛斯"] = "可选择的,三樓,达尔盖的旗帜,污力涛涛",["塞拉摩"] = "咕咕哒咕哒,疯子大叔",["艾露恩"] = "洁萝露尔",["血羽"] = "八云丷蓝",["阿尔萨斯"] = "須藤元気",["埃加洛尔"] = "超期哥",["暗影之月"] = "丶帕拉丁丶,苏灬姗",["埃克索图斯"] = "亲亲我的宝贝",["奈萨里奥"] = "偷光者",["试炼之环"] = "绅士的肥皂",["奥达曼"] = "Gnossienne",["羽月"] = "葬心,葬心,雨灵若雪",["巴尔古恩"] = "各位家长注意,宅男泡面",["阿古斯"] = "飞霜点墨,骷髅政委",["千针石林"] = "茄灬子",["燃烧军团"] = "尖刀片",["永恒之井"] = "圣光小钢炮",["冰风岗"] = "奈紋摩尔",["雷霆之王"] = "风之惩戒",["金度"] = "雨天小猪",["艾森娜"] = "钢然",["月光林地"] = "我爱偷吻贼,尘世,布可丝意",["铜龙军团"] = "Drakeshuffle,秋风之刃",["库尔提拉斯"] = "迦兰之心",["银松森林"] = "胖子的胖次,我看到你们啦",["語風[TW]"] = "初蝶",["加里索斯"] = "毒奶蕾玖",["卡德罗斯"] = "邪恶肥嘟嘟",["石爪峰"] = "采采矿打酱油",["屠魔山谷"] = "海月星",["弗塞雷迦"] = "紫睛娃娃",["日落沼澤[TW]"] = "在下頭很硬,在下頭很硬",["织亡者"] = "Vampiresover",["布兰卡德"] = "乐正普鲁",["太阳之井"] = "贾纳尔的怒吼",["加基森"] = "猛虎啸牙",["影牙要塞"] = "阿尔奎娅",["恐怖图腾"] = "赵德柱",["黑龙军团"] = "布莱克丶汉德",["地狱之石"] = "留神丨嘉年华",["古尔丹"] = "花萝艳",["巨龙之吼"] = "威风西域",["夏维安"] = "天谴冥王",["荆棘谷"] = "狂野老司机",["风暴峭壁"] = "云雾缭绕",["燃烧平原"] = "Geminids",["暴风祭坛"] = "小荳贼",["通灵学院"] = "大琯人,灬冰爽茶,炽蝎",["索瑞森"] = "嗜魂之手,麒麟臂",["诺莫瑞根"] = "郁郁",["红龙军团"] = "开门查煞能",["泰拉尔"] = "阿莱克,Paradise",["苏塔恩"] = "心心幻",["霍格"] = "BigRain",["祖阿曼"] = "饭米粒",["奥杜尔"] = "、冬",["军团要塞"] = "茗魅",["基尔加丹"] = "雪冰",["天空之墙"] = "秦王李世民",["萨尔"] = "光与暗的故事",["沙怒"] = "埃罗芒阿老师",["埃德萨拉"] = "奈何回忆",["龙骨平原"] = "三潭不印月",["安格博达"] = "迷墙",["踏梦者"] = "英雄海",["聖光之願[TW]"] = "奔跑的肥肉",["瓦里安"] = "亲亲灬紫堇",["黑铁"] = "歪特",["狂热之刃"] = "貌似妖怪",["奥蕾莉亚"] = "微笑的公牛",["斯克提斯"] = "怯雨羞云",["永夜港"] = "阿布丢丢"},["2018-07-31"] = {["奥尔加隆"] = "镜丶伤",["布兰卡德"] = "乐正普鲁,聖光的恩赐,骨化风橙,彼岸的回忆,月葬小歪,安梦少年豆,胡大力喲",["寒冰皇冠[TW]"] = "拜因德拉莫",["太阳之井"] = "点丿滴",["安苏"] = "童舞天橙,童舞天城,千里流浪,杰赫里斯,丶什锦咖喱饭,含朕龙根,国宝大喵,玛法利奥怒风",["熔火之心"] = "阿尔泰尔丶",["泰兰德"] = "Pandag,钻石星尘",["森金"] = "鱼香白牛",["奥特兰克"] = "云影的信守",["狂热之刃"] = "丨丶萨满笣苞",["闪电之刃"] = "来一发脑残箭",["丽丽（四川）"] = "我杀了大臭,乀丶阿宝,单纯王丶",["迦拉克隆"] = "混乱的小白,詹姆斯张飞,一塊红布,混沌女皇,踏风起武",["斩魔者"] = "安洛丶黎阳,木叶蛀牙",["白银之手"] = "天赐丶优雅,丨炎爆术丨,小木剑闯天涯,深圳鱼帅,紫夜魔月,玮玮小土豆,青春正绽放,贰姨太,为什么这么皮,间于生死,黑白光影,樓先生,表面输出,请叫我倾慕灬,不知道我是谁,月落丶霜满天,秋雨寒风,蕾迦娜",["冰霜之刃"] = "幕后黑手",["金色平原"] = "麥麥,轻轻叶落,核桃空空",["永恒之井"] = "小菇靚,耶稣,淼不语",["熊猫酒仙"] = "Alyn,贝蒂威尔,天道众",["燃烧之刃"] = "圣骑小魔,Nukacola,挫骨扬咴",["贫瘠之地"] = "凯撒丶昊,疾风丨什叁,忘却录音,正宗羊肉,玲珑刃,胖哥丶喵骑,空白,诗人尚喜",["主宰之剑"] = "落花昊骑,卡布琦诺,彪呼呼,消失的小德",["格瑞姆巴托"] = "逐风者之剑,烟灰灰,袭酆,六神眼药水,给我药,瑾云阳,炽美",["血色十字军"] = "手写从前,屠夫阿宝,可可的奶,冷裤勇士,米露果",["黑石尖塔"] = "古一",["勇士岛"] = "圣图拉",["洛丹伦"] = "秋水长天,苏想",["加兹鲁维"] = "被牛顶过,招财小呆",["死亡之翼"] = "开个噬血,希望皇霍普,四個核訫癔識,派哒星,圣光屏障,Shoothunter,亮爪,丹丹的忧桑,宝宝雙",["末日祷告祭坛"] = "天涯小术",["安威玛尔"] = "諾丨訫",["朵丹尼尔"] = "凤湖",["阿比迪斯"] = "文森",["回音山"] = "油腻嘎,北斗天狼星,绿果果,神锋無影",["利刃之拳"] = "jjboomfly,岳阳监狱狱霸",["提瑞斯法"] = "把妹之手",["迅捷微风"] = "Clownce,冲锋爱丽丝,神原骏河",["天空之墙"] = "我没獠牙",["凤凰之神"] = "斗篷与匕首,地狱灬,香辣小烤鸡,专精塑能,克里空,欧洲的茶叶蛋",["雷斧堡垒"] = "云歌丶岚岫",["罗宁"] = "藿香不正气,悦之守护,战神地狱火,丢雷螺母",["世界之树"] = "Xiaopprimee",["伊森利恩"] = "宝叔叔,红毛狮子,唐小欣,孖丶車,馨有琳心",["憤怒使者[TW]"] = "舞鴉",["无尽之海"] = "影嘉,莫道销魂",["黑铁"] = "细雨晚安,樱婲暩",["海加尔"] = "Kurt,Sera",["轻风之语"] = "猫妖,天神丨酒歌",["加基森"] = "兼职口粮",["国王之谷"] = "两仪陌岚,战戈弋弋",["山丘之王"] = "吾皇巴扎嘿",["冰风岗"] = "乳摇哥,斩它马的啊,经典丨杜蕾斯",["石爪峰"] = "夏屿落",["月光林地"] = "光之蕾拉,寇根",["伊瑟拉"] = "中原麻衣",["洛萨"] = "绯红一刀",["暗影之月"] = "杜拾遗,嗜血煞星,暗夜逐风",["塞拉摩"] = "泣灵",["血环"] = "火籽,卡卡、迦夜,不再颓废",["晴日峰（江苏）"] = "酱油里的芥末",["萨尔"] = "車小树",["月神殿"] = "怀念雅典娜",["苏塔恩"] = "Akài",["哈卡"] = "叮当当咚咚当",["末日行者"] = "猫在逗我玩,系马倚白杨,冰箱爱你哟,Therichskrr,Arcobalone",["桑德兰"] = "就是这么烦,大吃货",["暗影议会"] = "潘大先生",["羽月"] = "年迈的战屌",["达斯雷玛"] = "冷风过境",["诺兹多姆"] = "月影信仰,为童稚们送奶,豆奶不太粉",["阿拉索"] = "帝蛙爱你哟",["古加尔"] = "呜呼哀哉",["暴风祭坛"] = "無所畏懼,萨满兄",["莱索恩"] = "张铁柱",["影之哀伤"] = "肥小贱",["阿斯塔洛"] = "黄金体验",["克尔苏加德"] = "千里招招,大雄",["白骨荒野"] = "不能打不能奶",["能源舰"] = "牛重征",["阿古斯"] = "猎血沸腾",["伊莫塔尔"] = "夜诺斯",["索拉丁"] = "疯隐士",["万色星辰"] = "第四个影子",["寒冰皇冠"] = "Sky",["翡翠梦境"] = "麒哆圈",["阿克蒙德"] = "花花大魔王",["霜之哀伤"] = "遊僧,青椒荷包蛋",["血牙魔王"] = "巫马野兽",["熵魔"] = "天使之翎,爱薇儿",["千针石林"] = "艺双馨",["亚雷戈斯"] = "小鸡的小柯基",["基尔罗格"] = "巴特洛夫斯基",["耐奥祖"] = "演员,丹妮莉丝",["加里索斯"] = "拉灯叔",["梦境之树"] = "道外吴彦祖",["埃德萨拉"] = "神話丶喵尐姐",["守护之剑"] = "狐乱羽",["埃苏雷格"] = "蓝焰",["海克泰尔"] = "好人一身皮干",["巫妖之王"] = "幻月如梦",["麦迪文"] = "特丽丝",["迦罗娜"] = "飘逸贝贝",["诺莫瑞根"] = "熊老夫子"},["2018-07-30"] = {["达尔坎"] = "橙阿鬼丶",["血色十字军"] = "奶瓶小裤衩"}}

local realms, players, player_days = {}, {}, {}
for day, dayrealms in pairs(U1Donators.players) do
    for realm, nameStr in pairs(dayrealms) do
        if not tContains(realms, realm) then table.insert(realms, realm) end
        local names = { strsplit(",", nameStr) }
        for _, name in ipairs(names) do
            table.insert(players, name..'-'..realm)
            player_days[name..'-'..realm] = day;
        end
    end
end

U1Donators.players = nil
table.sort(players, function(a, b)
    local _, r1 = strsplit("-", a)
    local _, r2 = strsplit("-", b)
    if r1 == r2 then return a < b end
    if r1 == '???' then return false end
    if r2 == '???' then return true end
    return r1 < r2;
end)

function U1Donators:CreateFrame()
    local f = WW:Frame("U1DonatorsFrame", UIParent, "BasicFrameTemplateWithInset"):Size(320, 500):TR(U1Frame, "TL", -10, 0):SetToplevel(1):SetFrameStrata("DIALOG")

    f.TitleText:SetText("爱不易的捐助者，谢谢你们")
    f.InsetBg:SetPoint("TOPLEFT", 4, -50)
    CoreUIMakeMovable(f)

    local scroll = CoreUICreateHybridStep1(nil, f(), nil, true, true, nil)
    WW(scroll):TL(f.InsetBg, 3, -3):BR(f.InsetBg, -2-21, 2):un() --:TL(3, -20)
    f.scroll = scroll

    local headn = TplColumnButton(f, nil, 22):SetWidth(108):SetText("玩家主角色"):SetScript("OnClick", noop):un()
    WW(headn:GetFontString()):SetFontHeight(14):un()
    local heads = TplColumnButton(f, nil, 22):SetWidth(80):SetText("服务器"):SetScript("OnClick", noop):un()
    WW(heads:GetFontString()):SetFontHeight(14):un()
    local headd = TplColumnButton(f, nil, 22):SetWidth(100):SetText("捐助时间"):SetScript("OnClick", noop):un()
    WW(headd:GetFontString()):SetFontHeight(14):un()
    CoreUIAnchor(f, "TOPLEFT", "TOPLEFT", 8, -30, "LEFT", "RIGHT", 0, 0, headn, heads, headd)

    local function fix_text_width(obj)
      obj:GetFontString():SetAllPoints()
    end

    scroll.creator = function(self, index, name)
      local row = WW(self.scrollChild):Button(name):LEFT():RIGHT():Size(0, 20)
      row:SetHighlightTexture([[Interface\QuestFrame\UI-QuestTitleHighlight]], 'ADD')

      row.name = row:Button():Size(100, 20):EnableMouse(false):SetButtonFont(U1FCenterTextMid):SetText(111):GetButtonText():SetJustifyH("Center"):up()
      row.server = row:Button():Size(75, 20):EnableMouse(false):SetButtonFont(U1FCenterTextTiny):SetText(111):GetButtonText():SetJustifyH("Right"):up()
      row.firstdate = row:Button():Size(90, 20):EnableMouse(false):SetButtonFont(U1FCenterTextTiny):SetText(333):GetButtonText():SetJustifyH("Right"):up()

      fix_text_width(row.name)
      fix_text_width(row.server)
      fix_text_width(row.firstdate)

      CoreUIAnchor(row, "LEFT", "LEFT", 5, 0, "LEFT", "RIGHT", 5, 0, row.name, row.server, row.firstdate)
      return row:un()
    end

    scroll.getNumFunc = function()
      return #players
    end

    scroll.updateFunc = function(self, row, index)
      row.index = index
      local name, realm = strsplit('-', players[index])
      row.name:SetText(name)
      row.server:SetText(realm)
      row.firstdate:SetText(player_days[players[index]]);
      --row.name:GetFontString():SetTextColor(1,1,1)
      --local date_fmt = '%Y/%m/%d'
      --local txt = date(date_fmt, time())
      --row.firstdate:SetText(txt)
    end

    CoreUICreateHybridStep2(scroll, 0, 0, "TOPLEFT", "TOPLEFT", 0)

    f:Hide();
    return f()
end


